{
  "blogs": [
    {
      "id": "be52732d-ffa6-401f-89df-03d0d56102d5",
      "title": "Let’s Stop Calling It “Content”",
      "author": "Hollywood and tech firms want to reduce culture to a slurry of interchangeable bits. Let’s not help them out..",
      "content": "I remember the first time I started hearing the word “content”.\n\nIt was back in the late 1990s, during the delirious height of the “dot com” boom. Corporations were rolling out web sites, the hawt digital technology of the day. These companies all wanted their websites to be “sticky” — i.e. to give people a reason to stick around. That meant they needed to have lots of arresting, cool stuff to read and view. And that meant they were commissioning articles, photography, animations, and occasionally even short films or commercials (though most Americans still had dial-up modems that made online video farcically slow).\n\nIt was thus, for a brief year or so, a weirdly good time to be a writer, a photographer, or an illustrator. Money for one’s work was plentiful.\n\nThe only unsettling thing for me was the terminology. All those companies building web sites, and all their creative directors and the folks running the web-design startups, kept collapsing these very different forms of culture — writing and photography and animation and illustration — into one all-fungible phrase:\n\n“Content”.\n\nAs in, We need some content for this site!\n\nI’d get a phone call — to my landline phone, bien sur, this was 1999 — and it would be a friend of mine who worked for a web-design firm. They’d ask if I knew any writers: “Our new client is gonna need a ton of content.”\n\nFrom the get-go, I found “content” a truly depressing coinage.\n\nSure, I could understand why all the tech and business folks used it. “Content”, as a phrase, is usefully efficient. It gives you a blanket term to discuss a huge variety of forms of expression — prose, photography, TV, drama, music, illustration and more.\n\nThe problem, of course, is that “content” — the way these folks were slinging it around — more or less posits that there is no distinction between any of these extremely different cultural forms. Text, pictures, animation, comedy, drama, reporting, marketing: Whatevs, folks, it’s all content, right? The point, back in…"
    },
    {
      "id": "c7e6f729-8511-4475-bd46-f8809bcee6e6",
      "title": "The Ideal Social Network",
      "author": "Let’s Build A New Social Platform From Scratch",
      "content": "I believe it’s possible to build an ideal social network that has all the conceptual benefits of social media while addressing the fundamental issues with today’s platforms.\n\nHere’s how it works. Imagine a platform where every new user is given 1,000 points when they join. As they see content they like, they can allocate some or all of their points to that creator. The more points a creator has at any given time, the more distribution their content gets.\n\nBut the points decay over time in a predictable and transparent way. Gradually, points get reallocated across the user base. The more points you have, the faster you lose them. If you have less than 1,000, you’re incrementally brought back up. The network perpetually tries to return itself to a state of equilibrium, and it’s the innovation of the community and proliferation of high-quality content that prevents that from happening.\n\n"
    },
    {
      "id": "0b07188b-9c72-4b8d-b05d-dadc6b53465e",
      "title": "‘Oumuamua: Natural or Artificial?",
      "author": "A discussion of the evidence for and against ‘Oumuamua as an alien spacecraft",
      "content": "Discovery of the first large interstellar visitor:\nFor decades, scientists anticipated the discovery of objects from other stars passing through the Solar System. (One of us remembers their grad school advisor — Tom Quinn at the University of Washington — talking about this in the early 2000s, at which time the subject already had a long history.) It was not a mainstream subject of study because no such `interstellar’ objects had yet been found.\n\nIt was already well-known that cosmic rays and some dust particles were interstellar, and we’ve had physical samples of those for decades. It had also been proposed that some comets in the Oort cloud (a vast reservoir of comets swarming around the sun thousands of times the Earth-Sun distance) had been captured from sibling stars in the Sun’s birthplace. What was missing was a clear sign of a macroscopic object coming from outside our Sun’s sphere of influence. We call these interstellar objects.\n\nOn October 18th 2017, the first (confirmed) interstellar streak was detected in an image taken with the PAN-STARRS2 telescope in Hawaii. The object looked like a streak rather than a point of light because it was moving so fast across the sky. The timeline of what happened next is fascinating and documented in Karen Meech’s TED talk. That object was named ‘Oumuamua, meaning ‘advance scout’ in Hawaiian."
    },
    {
      "id": "003983c6-e5c6-4ad9-971b-db7263825921",
      "title": "5 Lessons on Career Growth from a Google Exec",
      "author": "There is no easy path. The elevator is broken, and you need to take the stairs and climb fast.",
      "content": "For the past 10 years, I have been on an accelerated career growth path. I went from Jr. Engineer to Engineering Director, navigated through 2 acquisitions, held over 1000s interviews, and built teams and engineering organizations.\n\nFrom my own experience and from the experience of helping other people develop their careers, I wanted to share 5 lessons that I found very useful and that will hopefully help you in your pursuit.\n\nThis article is based on my Medium Day talk that I held on the 12th of August.\n\nHow to choose the right opportunities\nEarly in my career, I had to choose between staying at a well-paid engineering job with an internationally established company or joining a new risky hardware startup. Everybody was surprised I joined the startup given the fact that I am very risk-averse. But in my mind, it all made sense, as I found an asymmetric opportunity that had a good risk/reward ratio. Let me explain.\n\nMy desire at that point was to learn more about startups, so when the opportunity presented I had to weigh the risk/reward balance.\n\nThe downside was that I would be getting a 35% pay cut and I would most likely be out of a job in 1.5 years because most startups are risky.\nThe upside was that I would learn 10x more and get exposed to various parts of the business and communities plus not ignoring the slim chance of getting rich.\nAt that point, I had an asymmetric opportunity on my hands that had a manageable downside and a potentially unlimited upside. In the end, my choice has put me on the path I am today and turned out to be a good choice.\n\nEvery time you are presented with an opportunity, look at the risk/reward ratio. If you stumble upon an asymmetric opportunity with unlimited upside and limited downside aligned with what you want, then take it. It may advance your career a lot.\n\nCompete where there is low competition\nIn every company, there are usually a few projects that everyone wants to do and projects that everybody tries to stay away from.\n\nThe big hard projects or the mundane ones that have a lot of value are usually overlooked. That is where you could have a big impact and stand out.\n\nA few areas where there is usually low competition:\n\nHard work:\nIt goes without saying, but a lot of people want to get rich quickly, lose weight in 5 easy steps, or put in minimum effort and get maximum returns. This kind of offering is very appealing and most of the time not true. Nobody wants to go on the path where there is hard work, even though there are better chances of success.\n\nHard work comes in multiple forms. It may be something technically difficult with a high risk of blowing up the system or a complex organizational task due to alignment which may mean getting consensus with a lot of stakeholders and having a lot of meetings. Find the things that are impactful for your stakeholders and do them. This way you will stand out, get new skills, and get on an accelerated path.\n\nInnovation:\nBring innovation to the company. Usually, everybody is trying to do their day-to-day job, and this is forgotten. In my experience innovation does not occur from a manager coming and asking their team to become more innovative."
    }
  ]
}